# цикл while, примеры
# Цикл while (повторение части кода)
# while <условие>:
#     <блок кода>

print('Начинаем выволнение цикла while')
print('__________')
i = 1
while i < 10:
    i = i * 2
    print(i)
print('_________')
print('Конец выполнения цикла while')
print('_________________________')
print('_________________________')
a = 1
while a < 10:
    print('Цикл выполнился', a, 'раз(а)')
    a = a + 1
print('Цикл окончен')
print('_________________________')
print('_________________________')
a = 1
while a < 5:
    print('условие верно')
    a = a + 1
else:
    print('условие неверно')
print('_________________________')
print('_________________________')
a = 1
while a < 5:
    a += 1
    if a == 3:
        break
    print(a)  # 2
